> # wrong type
> iris %>% group_by(Species) %>% filter(1:n())
Error: `filter()` argument `..1` is incorrect
x It must be a logical vector, not a integer
i The error occured in group 1

> iris %>% filter(1:n())
Error: `filter()` argument `..1` is incorrect
x It must be a logical vector, not a integer

> # wrong size
> iris %>% group_by(Species) %>% filter(c(TRUE, FALSE))
Error: `filter()` argument `..1` is incorrect
x It must be of size 50 or 1, not size 2
i The error occured in group 1

> iris %>% filter(c(TRUE, FALSE))
Error: `filter()` argument `..1` is incorrect
x It must be of size 150 or 1, not size 2

> # wrong size in column
> iris %>% group_by(Species) %>% filter(data.frame(c(TRUE, FALSE)))
Error: `filter()` argument `..1` is incorrect
x It must be of size 50 or 1, not size 2
i The error occured in group 1

> iris %>% filter(data.frame(c(TRUE, FALSE)))
Error: `filter()` argument `..1` is incorrect
x It must be of size 150 or 1, not size 2

> # wrong type in column
> iris %>% group_by(Species) %>% filter(data.frame(Sepal.Length > 3, 1:n()))
Error: `filter()` argument `..1$X1.n..` is incorrect
x It must be a logical vector, not a integer
i The error occured in group 1

> iris %>% filter(data.frame(Sepal.Length > 3, 1:n()))
Error: `filter()` argument `..1$X1.n..` is incorrect
x It must be a logical vector, not a integer

> # evaluation error
> mtcars %>% filter(`_x`)
Error: `filter()` argument `..1` errored
x object '_x' not found

> mtcars %>% group_by(cyl) %>% filter(`_x`)
Error: `filter()` argument `..1` errored
x object '_x' not found
i The error occured in group 1

> # named inputs
> filter(mtcars, x = 1)
Error: `filter()` argument `..1` is named
i This usually means `=` is used insted of `==`
i Did you mean: `x == 1`

> filter(mtcars, x = "A")
Error: `filter()` argument `..1` is named
i This usually means `=` is used insted of `==`
i Did you mean: `x == "A"`

> filter(mtcars, x = 1 & y > 2)
Error: `filter()` argument `..1` is named
i This usually means `=` is used insted of `==`
i Did you mean: `x == 1 & y > 2`

> filter(mtcars, x = 1, y > 2, z = 3)
Error: `filter()` argument `..1` is named
i This usually means `=` is used insted of `==`
i Did you mean: `x == 1`

