
Messages about .groups=
=======================

> eval_bare(expr(tibble(x = 1, y = 2) %>% group_by(x, y) %>% summarise()), env(
+   global_env()))
Message: `summarise()` regrouping by 'x' (override with `.groups` argument)

# A tibble: 1 x 2
# Groups:   x [1]
      x     y
  <dbl> <dbl>
1     1     2

> eval_bare(expr(tibble(x = 1, y = 2) %>% rowwise(x, y) %>% summarise()), env(
+   global_env()))
Message: `summarise()` grouping by 'x', 'y' (override with `.groups` argument)

# A tibble: 1 x 2
# Groups:   x, y [1]
      x     y
  <dbl> <dbl>
1     1     2


unsupported type
================

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% summarise(a = env(a = 1))
Error: Problem with `summarise()` input `a`.
x Input `a` must be a vector, not an environment.
i Input `a` is `env(a = 1)`.

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% group_by(x, y) %>% summarise(a = env(
+   a = 1))
Error: Problem with `summarise()` input `a`.
x Input `a` must be a vector, not an environment.
i Input `a` is `env(a = 1)`.
i The error occured in group 1: x = 1, y = 1.

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% rowwise() %>% summarise(a = lm(
+   y ~ x))
Error: Problem with `summarise()` input `a`.
x Input `a` must be a vector, not a `lm` object.
i Input `a` is `lm(y ~ x)`.
i Did you mean: `a = list(lm(y ~ x))` ?
i The error occured in row 1.


mixed types
===========

> tibble(id = 1:2, a = list(1, "2")) %>% group_by(id) %>% summarise(a = a[[1]])
Error: Problem with `summarise()` input `a`.
x Input `a` must return compatible vectors across groups
i Input `a` is `a[[1]]`.
i Result type for group 1 (id = 1): <double>.
i Result type for group 2 (id = 2): <character>.

> tibble(id = 1:2, a = list(1, "2")) %>% rowwise() %>% summarise(a = a[[1]])
Error: Problem with `summarise()` input `a`.
x Input `a` must return compatible vectors across groups
i Input `a` is `a[[1]]`.


incompatible size
=================

> tibble(z = 1) %>% summarise(x = 1:3, y = 1:2)
Error: Problem with `summarise()` input `y`.
x Input `y` must be size 3 or 1, not 2.
i Input `y` is `1:2`.
i An earlier column had size 3.

> tibble(z = 1:2) %>% group_by(z) %>% summarise(x = 1:3, y = 1:2)
Error: Problem with `summarise()` input `y`.
x Input `y` must be size 3 or 1, not 2.
i Input `y` is `1:2`.
i An earlier column had size 3.
i The error occured in group 1: z = 1.

> tibble(z = c(1, 3)) %>% group_by(z) %>% summarise(x = seq_len(z), y = 1:2)
Error: Problem with `summarise()` input `y`.
x Input `y` must be size 3 or 1, not 2.
i Input `y` is `1:2`.
i An earlier column had size 3.
i The error occured in group 2: z = 3.


Missing variable
================

> summarise(mtcars, a = mean(not_there))
Error: Problem with `summarise()` input `a`.
x object 'not_there' not found
i Input `a` is `mean(not_there)`.

> summarise(group_by(mtcars, cyl), a = mean(not_there))
Error: Problem with `summarise()` input `a`.
x object 'not_there' not found
i Input `a` is `mean(not_there)`.
i The error occured in group 1: cyl = 4.


.data pronoun
=============

> summarise(tibble(a = 1), c = .data$b)
Error: Problem with `summarise()` input `c`.
x Column `b` not found in `.data`
i Input `c` is `.data$b`.

> summarise(group_by(tibble(a = 1:3), a), c = .data$b)
Error: Problem with `summarise()` input `c`.
x Column `b` not found in `.data`
i Input `c` is `.data$b`.
i The error occured in group 1: a = 1.

