
unsupported type
================

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% summarise(a = env(a = 1))
Error: `summarise()` argument `a` incompatible
x Result should be a vector, not a environment
i `a` is env(a = 1)

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% group_by(x, y) %>% summarise(a = env(
+   a = 1))
Error: `summarise()` argument `a` incompatible
x Result should be a vector, not a environment
i `a` is env(a = 1)
i The error occured in group 1


mixed types
===========

> tibble(id = 1:2, a = list(1, "2")) %>% group_by(id) %>% summarise(a = a[[1]])
Error: `summarise()` argument `a` returns mixed types
x Error from vec_c() : No common type for `..1` <double> and `..2` <character>.
i `a` is a[[1]]

> tibble(id = 1:2, a = list(1, "2")) %>% rowwise() %>% summarise(a = a[[1]])
Error: `summarise()` argument `a` returns mixed types
x Error from vec_c() : No common type for `..1` <double> and `..2` <character>.
i `a` is a[[1]]


incompatible size
=================

> mtcars %>% summarise(x = 1:3, y = 1:2)
Error: `summarise()` argument `y` incompatible
x Result should be size 3, not 2
i `y` is 1:2
i An earlier column had size 3

> mtcars %>% group_by(cyl) %>% summarise(x = 1:3, y = 1:2)
Error: `summarise()` argument `y` incompatible
x Result should be size 3, not 2
i `y` is 1:2
i The error occured in group 1
i An earlier column had size 3 for the group 1


Missing variable
================

> summarise(mtcars, a = mean(not_there))
Error: `summarise()` argument `a` errored
x object 'not_there' not found
i `a` is mean(not_there)

> summarise(group_by(mtcars, cyl), a = mean(not_there))
Error: `summarise()` argument `a` errored
x object 'not_there' not found
i `a` is mean(not_there)
i The error occured in group 1

