
wrong type
==========

> iris %>% group_by(Species) %>% filter(1:n())
Error: Problem with `filter()` input `..1`.
x `..1` must be a logical vector, not a integer.
i Input `..1` is `1:n()`.
i The error occured in group 1: Species = "setosa".

> iris %>% filter(1:n())
Error: Problem with `filter()` input `..1`.
x `..1` must be a logical vector, not a integer.
i Input `..1` is `1:n()`.


wrong size
==========

> iris %>% group_by(Species) %>% filter(c(TRUE, FALSE))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 50 or 1, not size 2.
i Input `..1` is `c(TRUE, FALSE)`.
i The error occured in group 1: Species = "setosa".

> iris %>% rowwise(Species) %>% filter(c(TRUE, FALSE))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 1, not size 2.
i Input `..1` is `c(TRUE, FALSE)`.
i The error occured in row 1.

> iris %>% filter(c(TRUE, FALSE))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 150 or 1, not size 2.
i Input `..1` is `c(TRUE, FALSE)`.


wrong size in column
====================

> iris %>% group_by(Species) %>% filter(data.frame(c(TRUE, FALSE)))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 50 or 1, not size 2.
i Input `..1` is `data.frame(c(TRUE, FALSE))`.
i The error occured in group 1: Species = "setosa".

> iris %>% rowwise() %>% filter(data.frame(c(TRUE, FALSE)))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 1, not size 2.
i Input `..1` is `data.frame(c(TRUE, FALSE))`.
i The error occured in row 1.

> iris %>% filter(data.frame(c(TRUE, FALSE)))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 150 or 1, not size 2.
i Input `..1` is `data.frame(c(TRUE, FALSE))`.

> tibble(x = 1) %>% filter(c(TRUE, TRUE))
Error: Problem with `filter()` input `..1`.
x `..1` must be of size 1, not size 2.
i Input `..1` is `c(TRUE, TRUE)`.


wrong type in column
====================

> iris %>% group_by(Species) %>% filter(data.frame(Sepal.Length > 3, 1:n()))
Error: Problem with `filter()` input `..1`.
x `..1$X1.n..` must be a logical vector, not a integer.
i Input `..1` is `data.frame(Sepal.Length > 3, 1:n())`.
i The error occured in group 1: Species = "setosa".

> iris %>% filter(data.frame(Sepal.Length > 3, 1:n()))
Error: Problem with `filter()` input `..1`.
x `..1$X1.n..` must be a logical vector, not a integer.
i Input `..1` is `data.frame(Sepal.Length > 3, 1:n())`.


evaluation error
================

> mtcars %>% filter(`_x`)
Error: Problem with `filter()` input `..1`.
x object '_x' not found
i Input `..1` is `_x`.

> mtcars %>% group_by(cyl) %>% filter(`_x`)
Error: Problem with `filter()` input `..1`.
x object '_x' not found
i Input `..1` is `_x`.
i The error occured in group 1: cyl = 4.


named inputs
============

> filter(mtcars, x = 1)
Error: Problem with `filter()` input `..1`
x Input `..1` is named
i This usually means that you've used `=` instead of `==`.
i Did you mean `x == 1` ?

> filter(mtcars, y > 2, z = 3)
Error: Problem with `filter()` input `..2`
x Input `..2` is named
i This usually means that you've used `=` instead of `==`.
i Did you mean `z == 3` ?

> filter(mtcars, TRUE, x = 1)
Error: Problem with `filter()` input `..2`
x Input `..2` is named
i This usually means that you've used `=` instead of `==`.
i Did you mean `x == 1` ?


ts
===

> filter(ts(1:10))
Error: Problem with `filter()` input `.data`
x `.data` is a ts object, not a data source
i Did you want to use `stats::filter()` ?

