
unsupported type
================

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% summarise(a = env(a = 1))
Error: `summarise()` argument `a` must be a vector
x Result should be a vector, not a environment
i `a` is env(a = 1)

> tibble(x = 1, y = c(1, 2, 2), z = runif(3)) %>% group_by(x, y) %>% summarise(a = env(
+   a = 1))
Error: `summarise()` argument `a` must be a vector
x Result should be a vector, not a environment
i `a` is env(a = 1)
x The error occured in group 1
i group keys: x = 1
i group keys: y = 1


mixed types
===========

> tibble(id = 1:2, a = list(1, "2")) %>% group_by(id) %>% summarise(a = a[[1]])
Error: `summarise()` argument `a` must return compatible vectors across groups
x Error from vec_c() : No common type for `..1` <double> and `..2` <character>.
i `a` is a[[1]]

> tibble(id = 1:2, a = list(1, "2")) %>% rowwise() %>% summarise(a = a[[1]])
Error: `summarise()` argument `a` must return compatible vectors across groups
x Error from vec_c() : No common type for `..1` <double> and `..2` <character>.
i `a` is a[[1]]


incompatible size
=================

> tibble(z = 1) %>% summarise(x = 1:3, y = 1:2)
Error: `summarise()` argument `y` must be recyclable
i `y` is 1:2
x Result should be size 3 or 1, not 2
i An earlier column had size 3

> tibble(z = 1:2) %>% group_by(z) %>% summarise(x = 1:3, y = 1:2)
Error: `summarise()` argument `y` must be recyclable
i `y` is 1:2
x Result should be size 3 or 1, not 2
i An earlier column had size 3
x The error occured in group 1
i group keys: z = 1

> tibble(z = 2:1) %>% group_by(z) %>% summarise(x = seq_len(z), y = 1:2)
Error: `summarise()` argument `y` must be recyclable
i `y` is 1:2
x Result should be size 1, not 2
i An earlier column had size 1
x The error occured in group 1
i group keys: z = 1


Missing variable
================

> summarise(mtcars, a = mean(not_there))
Error: `summarise()` argument `a` errored
x object 'not_there' not found
i `a` is mean(not_there)

> summarise(group_by(mtcars, cyl), a = mean(not_there))
Error: `summarise()` argument `a` errored
x object 'not_there' not found
i `a` is mean(not_there)
x The error occured in group 1
i group keys: cyl = 4

